var appdata = {
    "sex":{ 
        "male":{
            "English":"Male",
            "தமிழ்":"ஆண்"
        },
        "female":{
            "English":"Female",
            "தமிழ்":"பெண்"  
        }

    },
    "planets" : {
        "1":"sun",
        "2":"moon",
        "3":"mercury",
        "4":"venus",
        "5":"mars",
        "6":"jupiter",
        "7":"saturn",
        "8":"rahu",
        "9":"ketu",
        "sun":"சூரியன்",
        "moon":"சந்திரன்",
        "mercury":"புதன்",
        "venus": "சுக்கிரன்",
        "mars":"செவ்வாய்",
        "jupiter":"குரு",
        "saturn":"சனி",
        "rahu":"இராகு",
        "ketu":"கேது",
        "சூரியன்": "sun",
        "சந்திரன்":"moon",
        "புதன்":"mercury",
        "சுக்கிரன்":"venus",
        "செவ்வாய்":"mars",
        "குரு":"jupiter",
        "சனி":"saturn",
        "இராகு":"rahu",
        "கேது":"ketu"
        },
    "rasis" : {
        "1":"மேஷம்",
        "2":"ரிஷபம்",
        "3":"மிதுனம்",
        "4":"கடகம்",
        "5":"சிம்மம்",
        "6":"கன்னி",
        "7":"துலாம்",
        "8":"விருச்சிகம்",
        "9":"தனுசு",
        "10":"மகரம்",
        "11":"கும்பம்",
        "12":"மீனம்",
        "Aries":"மேஷம்",
        "Taurus":"ரிஷபம்",
        "Gemini":"மிதுனம்",
        "Cancer":"கடகம்",
        "Leo":"சிம்மம்",
        "Virgo":"கன்னி",
        "Libra":"துலாம்",
        "Scorpio":"விருச்சிகம்",
        "Sagitarius":"தனுசு",
        "Capricorn":"மகரம்",
        "Aquarius":"கும்பம்",
        "Pisces":"மீனம்",
        "மேஷம்":"Aries",
        "ரிஷபம்":"Taurus",
        "மிதுனம்":"Gemini",
        "கடகம்":"Cancer",
        "சிம்மம்":"Leo",
        "கன்னி":"Virgo",
        "துலாம்":"Libra",
        "விருச்சிகம்":"Scorpio",
        "தனுசு":"Sagitarius",
        "மகரம்":"Capricorn",
        "கும்பம்":"Aquarius",
        "மீனம்":"Pisces"
    },
    "stars": {
        "1":"அசுவினி",
        "2":"பரணி",
        "3":"கிருத்திகை",
        "4":"ரோகிணி",
        "5":"மிருகசீரிஷம்",
        "6":"திருவாதிரை",
        "7":"புனர்பூசம்",
        "8":"பூசம்",
        "9":"ஆயில்யம்",
        "10":"மகம்",
        "11":"பூரம்",
        "12":"உத்திரம்",
        "13":"அஸ்த்தம்",
        "14":"சித்திரை",
        "15":"சுவாதி",
        "16":"விசாகம்",
        "17":"அனுஷம்",
        "18":"கேட்டை",
        "19":"மூலம்",
        "20":"பூராடம்",
        "21":"உத்திராடம்",
        "22":"திருவோணம்",
        "23":"அவிட்டம்",
        "24":"சதயம்",
        "25":"பூரட்டாதி",
        "26":"உத்திரட்டாதி",
        "27":"ரேவதி",
        "அசுவினி":"Ashwini",
        "பரணி":"Bharani",
        "கிருத்திகை":"Krittika",
        "ரோகிணி":"Rohini",
        "மிருகசீரிஷம்":"Mrigashīrsha",
        "திருவாதிரை":"Ārdrā",
        "புனர்பூசம்":"Punarvasu",
        "பூசம்":"Pushya",
        "ஆயில்யம்":"Āshleshā",
        "மகம்":"Maghā",
        "பூரம்":"Pūrva",
        "உத்திரம்":"Uttara",
        "அஸ்த்தம்":"Hasta",
        "சித்திரை":"Chitra",
        "சுவாதி":"Svātī",
        "விசாகம்":"Viśākhā",
        "அனுஷம்":"Anurādhā",
        "கேட்டை":"Jyeshtha",
        "மூலம்":"Mula",
        "பூராடம்":"Pūrva Āshādhā",
        "உத்திராடம்":"Uttara Āṣāḍhā",
        "திருவோணம்":"Śrāvaṇa",
        "அவிட்டம்":"Śrāviṣṭha",
        "சதயம்":"Shatabhisha",
        "பூரட்டாதி":"Pūrva Bhādrapadā",
        "உத்திரட்டாதி":"Uttara Bhādrapadā",
        "ரேவதி":"Revati",
        "animal":{
            "1":"அசுவினி",
            "2":"பரணி",
            "3":"கிருத்திகை",
            "4":"ரோகிணி",
            "5":"மிருகசீரிஷம்",
            "6":"திருவாதிரை",
            "7":"புனர்பூசம்",
            "8":"பூசம்",
            "9":"ஆயில்யம்",
            "10":"மகம்",
            "11":"பூரம்",
            "12":"உத்திரம்",
            "13":"அஸ்த்தம்",
            "14":"சித்திரை",
            "15":"சுவாதி",
            "16":"விசாகம்",
            "17":"அனுஷம்",
            "18":"கேட்டை",
            "19":"மூலம்",
            "20":"பூராடம்",
            "21":"உத்திராடம்",
            "22":"திருவோணம்",
            "23":"அவிட்டம்",
            "24":"சதயம்",
            "25":"பூரட்டாதி",
            "26":"உத்திரட்டாதி",
            "27":"ரேவதி"
        }
    },
    "rasiofstar" :{
                /*confirmed rasis
                [1,2] =1
                [4] =2
                [6] = 3
                [8,9] =4    
                [10,11] =5
                [13] =6
                [15] = 7
                [17,18] =8  
                [19,20] =9
                [22] =10
                [24] = 11
                [26,27] =12     
            */
        "1":"1",
        "2":"1",
        "4":"2",
        "6":"3",
        "8":"4",
        "9":"4",
        "10":"5",
        "11":"5",
        "13":"6",
        "15":"7",
        "17":"8",
        "18":"8",
        "19":"9",
        "20":"9",
        "22":"10",
        "24":"11",
        "26":"12",
        "27":"12"
    },
    "rasisofstar":{
        /*unconfirmed 
            3,5,7,12,14,16,21,23,25
        */
        "3":[1,2],
        "5":[2,3],
        "7":[3,4],
        "12":[5,6],
        "14":[6,7],
        "16":[7,8],
        "21":[9,10],
        "23":[10,11],
        "25":[11,12]
    },
    "languages" :{
        "default" : "தமிழ்",
        "en":"English",
        "ta":"தமிழ்"
    },
    "session":{
        "language" : "null",
        "error" : "null",
        "male_star" : "null",
        "female_star" : "null",
        "male_rasi" : "null",
        "female_rasi" : "null",
        "app_input_head" : {
            "English" : "Select male and female stars to compare",
            "தமிழ்" : "ஆண் மற்றும் பெண் நட்ச்சத்திரங்களை தேர்ந்தெடுக்கவும்"
    },
    "lbl_malestar_head":{
        "English" : "Male Star",
         "தமிழ்":"ஆண் நட்ச்சத்திரம்"
    },
    "lbl_femalestar_head":{
        "English" : "Female Star",
         "தமிழ்":"பெண் நட்ச்சத்திரம்"
    },
    "lbl_malerasi_head":{
        "English" : "Male Rasi",
         "தமிழ்":"ஆண் ராசி"
    },
    "lbl_femalerasi_head":{
        "English" : "Female Rasi",
         "தமிழ்":"பெண் ராசி"
    },
    "userinput_title":{
        "English" : "Your entered data",
        "தமிழ்":"நீங்கள் உள்ளிட்ட தகவல்"
    },
    "input_rasi": {
        "English" : "Rasi",
        "தமிழ்":"ராசி"
    },
    "input_star": {
        "English" : "Star",
        "தமிழ்":"நட்ச்சத்திரம்"
    },
    "porutham_result":{
        "Well" : {
            "English":"Well",
            "தமிழ்":"பொருத்தம் உண்டு"
        },
        "Not" : {
            "English":"Not",
            "தமிழ்":"பொருத்தம் இல்லை"
        },
        "Ok" : {
            "English":"Ok",
            "தமிழ்":"பரவாயில்லை"
        }                
    },    
    "porutham":{
        "dina":null,
        "gana":null
    }
    },//session
    
    //conditions for porutham
    //results : How much matching? Well, Not, Ok
    "dina": {
        "direction": "ftom",
        "Same_Star_Pass":[4,6,10,13,16,22,26,27],
        "Same_Star_Ok":[1,5,7,8,11,12,14,17,20,21],
        "Same_Star_Fail":[2,9,15,18,19,23,24,25],
        "Well":[2,4,6,8,9,11,13,15,18,20,24,26,"27_Equal_Rasi","Same_Star_Pass"],
        "Not":[7,10,19,22,"27_Unequal_Rasi","Same_Star_Fail"],
        "Ok":[3,5,12,14,16,17,21,23,25,"Same_Star_Ok"]
        }
                                                                                                    
  
    
    
};

